rails/app/controllers/magasins_controller.rb

SELECT "magasins".* FROM "magasins"
---
  def index
    @magasins = Magasin.all

INSERT INTO "magasins" ("nom", "latitude", "longitude", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["nom", "Big Fernand"], ["latitude", 48.105777], ["longitude", -1.678574], ["created_at", "2015-11-26 12:08:35.435902"], ["updated_at", "2015-11-26 12:08:35.435902"]]
---
  def create
    @magasin = Magasin.new(magasin_params)

    respond_to do |format|
      if @magasin.save

UPDATE "magasins" SET "longitude" = $1, "updated_at" = $2 WHERE "magasins"."id" = $3  [["longitude", -1.677963], ["updated_at", "2015-11-26 12:13:50.158911"], ["id", 2]]
---
  def update
    respond_to do |format|
      if @magasin.update(magasin_params)

SELECT  "magasins".* FROM "magasins" WHERE "magasins"."id" = $1 LIMIT 1  [["id", 2]]
---
    def set_magasin
      @magasin = Magasin.find(params[:id])