rails/app/controllers/welcome_controller.rb

SELECT  "magasins".* FROM "magasins"  ORDER BY "magasins"."id" ASC LIMIT 1
SELECT  id,location_type,vp_ne_lat,vp_ne_lng,vp_sw_lat,vp_sw_lng FROM "commerces"  ORDER BY "commerces"."id" ASC LIMIT 1 OFFSET 1450
SELECT COUNT(*) FROM "commerces"
SELECT COUNT(*) FROM "magasins"
---
  def index



  	#params.require(:req)

	if !params.has_key?(:req)
		redirect_to 'https://www.rennespoche.fr/api/bo'
	end

	if request.headers["CONTENT_TYPE"] == "application/json" || (params.has_key?(:format) && params[:format]=="json")


	# Debut des requetes
		if params[:req] == "path"

			if params.has_key?(:nombreMagasins) && params[:nombreMagasins].to_i > 0

				@y = Algo.getPath(params[:nombreMagasins].to_i)

			elsif params.has_key?(:coord_dep_lat)

				@y = Algo.getTagsPath(params['coord_dep_lat'], params['coord_dep_lng'], params['coord_arr_lat'], params['coord_arr_lng'], params['dist_max'], params['commerces'])

			else
				@y = Algo.getPath(0)
			end
			render json: {:size => @y.size(), :commerces => @y}

SELECT  "commerces".* FROM "commerces" WHERE "commerces"."id" = $1 LIMIT 1  [["id", nil]]
---

			uuid = params[:uuid]
			begin
				c = Commerce.where("id = ?", uuid).first